Revit 2026 API

# SystemZoneData Methods

---

The SystemZoneData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of a system-zone data domain class. |
|  | Dispose | (Inherited from GenericZoneDomainData) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

SystemZoneData Class

Autodesk.Revit.DB.Mechanical Namespace